Revit 2027 API
BuiltInFailures.ColumnFailures.ColumnBaseAboveTopError Property
 The column base can't be moved above its top.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ColumnBaseAboveTopError { get; }
Public Shared ReadOnly Property ColumnBaseAboveTopError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ColumnBaseAboveTopError {
	FailureDefinitionId^ get ();
}
static member ColumnBaseAboveTopError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ColumnFailures Class
Autodesk.Revit.DB Namespace